#Задача 2: Найдите сумму цифр трехзначного числа.
#*Пример:*
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |

a = int (input ("Введите число: "))
sum=0
x=0
while a > 0 :
    x = a%10
    sum =sum+x
    a=a//10
print (sum)

